fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_НачислениеФиксированнойПремии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ВКМ_Удержания</xr:Item>
				<xr:Item>CalculationRegister.ВКМ_ДополнительныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПремии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>ВКМ_ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>false</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>ВКМ_Удержания</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВКМ_ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_Удержания.Записывать = Истина;
    // Не забудьте также про новый регистр из задания:
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
    Для Каждого Стр Из СписокСотрудников Цикл
		
        // 1. Движение по Дополнительным начислениям
        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.Сотрудник = Стр.Сотрудник;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
        Движение.ПериодРегистрации = НачалоМесяца(Дата); // УСТАНОВИТЬ ОБЯЗАТЕЛЬНО
        Движение.Результат = Стр.СуммаПремии;
		
        // 2. Движение по Удержаниям (НДФЛ)
        ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
        ДвижениеНДФЛ.Сотрудник = Стр.Сотрудник;
        ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        
        // ВОТ ЭТА СТРОКА ИСПРАВЛЯЕТ ВАШУ ОШИБКУ:
        ДвижениеНДФЛ.ПериодРегистрации = НачалоМесяца(Дата); 
        
        ДвижениеНДФЛ.Результат = Стр.СуммаПремии * 0.13;
        
        // 3. Движение по Взаиморасчетам (согласно заданию "Выплата зарплаты")
        ДвижениеВз = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
        ДвижениеВз.Период = Дата;
        ДвижениеВз.Сотрудник = Стр.Сотрудник;
        ДвижениеВз.Сумма = Стр.СуммаПремии - ДвижениеНДФЛ.Результат;
		
    КонецЦикла;
	
КонецПроцедуры
